/*
1097 : [기초-2차원배열] 바둑알 십자 뒤집기(설명)

부모님을 기다리던 영일이는 검정/흰 색 바둑알을 바둑판에 꽉 채워 깔아 놓고 놀다가...

"십(+)자 뒤집기를 해볼까?"하고 생각했다.

바둑판(19 * 19)에 흰 돌(1) 또는 검정 돌(0)이 모두 꽉 채워져 놓여있을 때,
n개의 좌표를 입력받아 십(+)자 뒤집기한 결과를 출력하는 프로그램을 작성해보자.

참고
가로 번호, 세로 번호를 사용할 수 있는 2차원 배열을 사용하면
이러한 형태를 쉽게 기록하고 사용할 수 있다. 물론 더 확장한 n차원 배열도 만들 수 있다.


예시
int n, i, j, x, y;
int a[20][20]={};
for(i=1; i<=19; i++) //한 줄씩 바둑판 상황 입력 받기
  for(j=1; j<=19; j++)
    scanf("%d", &a[i][j]);

scanf("%d", &n); //좌표 개수 입력받기

for(i=1; i<=n; i++) //좌표의 개수만큼
{
  scanf("%d %d", &x, &y);
  for(j=1; j<=19; j++) //가로 줄 흑<->백 바꾸기
  {
    if(a[x][j]==0) a[x][j]=1;
    else a[x][j] = 0;
  }
  for(j=1; j<=19; j++) //세로 줄 흑<->백 바꾸기
  {
    if(a[j][y]==0) a[j][y]=1;
    else a[j][y] = 0;
  }
}
...
*/


#include <stdio.h>

int main() {
    int i, j, arr[20][20], n, x, y; 
    
    for (i = 1; i <= 19; i++){ // 바둑판 상황
        for (j = 1; j <= 19; j++)
            scanf("%d", &arr[i][j]);
    }
    
    scanf("%d", &n); // 횟수 입력
    
    for (i = 0; i < n; i++) {	// 뒤집기 n번 입력
        scanf("%d %d", &x, &y);
      
        for (j = 1; j <= 19; j++) {
            if (arr[x][j] == 1)
                arr[x][j] = 0;
            else
                arr[x][j] = 1;
        }
      
        for (j = 1; j <= 19; j++) {
            if (arr[j][y] == 1)
                arr[j][y] = 0;
            else
                arr[j][y] = 1;
        }
    }
    
    for (i = 1; i <= 19; i++){
        for (j = 1; j <= 19; j++)
            printf("%d ", arr[i][j]);
      
        printf("\n");
    }
    
    return 0;
}